Revit 2024 API
EnergyAnalysisOpening.GetPolyloops Method
 Gets the collection of planar polygons describing the opening geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public IList<Polyloop> GetPolyloops()
Visual Basic
Public Function GetPolyloops As IList(Of Polyloop)
Visual C++
public:
IList<Polyloop^>^ GetPolyloops()
Return Value
 The collection of polygons describing the opening geometry.
Remarks
 A collection of polyloops (planar polygons) describing the opening geometry as described in gbXML. The geometry is currently measured per analytical(center-line).
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace